import {Injectable} from '@angular/core';

@Injectable()
export class ServiceListService {

  constructor() {
  }

  serviceList = [
    {
      id: 1,
      title: '鼻饲【自备物品】',
      img: 'assets/img/bisi.jpg',
      time: '75分钟',
      price: 13000,
      detail: '鼻饲是将导管经鼻腔插入胃内，从管内输注食物、水分和药物，以维持病人的营养治疗的技术。（包含插胃管和首次鼻饲）家属自备物品：一次性无菌鼻胃管：（一套：胃管+无菌手套+鼻贴+盘带+无菌注射器），棉签，石蜡油，适量温开水（38～40℃），鼻饲饮料（肠内营养液）（38～40℃）。[温馨提示家属选择正规医院或者药店购买，注意检查物品有效期等] 护士备物品：听诊器、口罩、手消毒液',
      steps: [
        {
          title: '推送健康宣教知识',
          detail: '下单后，系统自动向患者开放服务的健康宣教知识'
        },
        {
          title: '服务前自测',
          detail: '服务前，患者进行自我测评'
        },
        {
          title: '服务前评估',
          detail: '评估客户情况，准备上门服务'
        },
        {
          title: '服务评估',
          detail: '操作前进行全面的评估客户'
        },
        {
          title: '操作前准备',
          detail: '检查物品和环境准备'
        },
        {
          title: '拔管操作',
          detail: '拔除旧鼻饲管'
        },
        {
          title: '置管操作',
          detail: '置入新鼻饲管'
        },
        {
          title: '操作后处理',
          detail: '整理物品，交代注意事项，预约随访和换管时间'
        },
        {
          title: '健康宣教',
          detail: '根据客户已有或者潜在的问题进行相关健康宣教'
        }
      ]
    },
    {
      id: 2,
      title: '导尿【自备物品】',
      img: 'assets/img/niaoguan.jpg',
      time: '75分钟',
      price: 13000,
      detail: '导尿，是经由尿道插入导尿管到膀胱，引流出尿液。提供导尿服务（包含尿管更换）、拔除尿管服务以及其他尿管渗漏、尿袋更换等服务。家属自备物品：超滑抗菌尿管：（一套：尿管+无菌手套+无菌注射器+盘带+含碘伏棉球）[温馨提示家属选择正规医院或者药店购买，注意检查物品有效期等]护士备物品：口罩、手消毒液',
      steps: [
        {
          title: '推送健康宣教知识',
          detail: '下单后，系统自动向患者开放服务的健康宣教知识'
        },
        {
          title: '服务前自测',
          detail: '服务前，患者进行自我测评'
        },
        {
          title: '服务前评估',
          detail: '评估客户情况，准备上门服务'
        },
        {
          title: '服务评估',
          detail: '操作前进行全面的评估客户'
        },
        {
          title: '操作前准备',
          detail: '检查物品和环境准备'
        },
        {
          title: '拔管操作',
          detail: '拔除旧导尿管'
        },
        {
          title: '置管操作',
          detail: '置入新导尿管'
        },
        {
          title: '操作后处理',
          detail: '整理物品，交代注意事项，预约随访和换管时间'
        },
        {
          title: '健康宣教',
          detail: '根据客户已有或者潜在的问题进行相关健康宣教'
        }
      ]
    },
    {
      id: 3,
      title: '伤口护理【自备物品】',
      img: 'assets/img/shangkou.jpg',
      time: '75分钟',
      price: 13000,
      detail: '[如果没有药品，护士不能提供上门服务]伤口清洁消毒，换敷料。可触及的伤口换药，是指已经进行外敷的药品，在到达规定的使用时间后，将旧的药物撤下，将新药物敷上，以保证药物的有效性，促进伤口愈合。家属自备物品：一次性换药包（内有弯盘、镊子、止血钳、无菌棉球、等）、碘伏、酒精、生理盐水、无菌纱布、无菌手套、各种适合的敷料、药品[温馨提示家属选择正规医院或者药店购买，注意检查物品有效期等] 护士备物品：口罩、手消毒液',
      steps: [
        {
          title: '推送健康宣教知识',
          detail: '下单后，系统自动向患者开放服务的健康宣教知识'
        },
        {
          title: '服务前自测',
          detail: '服务前，患者进行自我测评'
        },
        {
          title: '服务前评估',
          detail: '评估客户情况，准备上门服务'
        },
        {
          title: '服务评估',
          detail: '操作前进行全面的评估客户'
        },
        {
          title: '操作前准备',
          detail: '检查物品和环境准备'
        },
        {
          title: '拆旧纱布',
          detail: '拆除旧纱布'
        },
        {
          title: '伤口护理',
          detail: '伤口清洁、换新敷料'
        },
        {
          title: '操作后处理',
          detail: '整理物品，交代注意事项，预约随访和下次服务时间'
        },
        {
          title: '健康宣教',
          detail: '根据客户已有或者潜在的问题进行相关健康宣教'
        }
      ]
    },
    {
      id: 4,
      title: '造口护理【自备物品】',
      img: 'assets/img/zaokou.jpg',
      time: '75分钟',
      price: 13000,
      detail: '通过人造开口，帮助患者排除粪便或者尿液，造口袋是用于储存人体排泄物的容器物，如尿液、粪便，适用于肛肠、尿道、双腔造口人士。家属自备物品：造口剪刀、造口粉、防漏膏、皮肤保护膜、一次性手套、旧报纸或马甲袋、纸巾或棉签、干纱布、造口测量尺、纸胶、温盐水或者温开水、吸水纸。[温馨提示家属选择正规医院或者药店购买，注意检查物品有效期等] 护士备物品：口罩、手消毒液',
      steps: [
        {
          title: '推送健康宣教知识',
          detail: '下单后，系统自动向患者开放服务的健康宣教知识'
        },
        {
          title: '服务前自测',
          detail: '服务前，患者进行自我测评'
        },
        {
          title: '服务前评估',
          detail: '评估客户情况，准备上门服务'
        },
        {
          title: '服务评估',
          detail: '操作前进行全面的评估客户'
        },
        {
          title: '操作前准备',
          detail: '检查物品和环境准备'
        },
        {
          title: '拆除旧造口袋',
          detail: '拆除旧造口袋'
        },
        {
          title: '造口护理',
          detail: '造口清洁、换新造口袋'
        },
        {
          title: '操作后处理',
          detail: '整理物品，交代注意事项，预约随访和下次服务时间'
        },
        {
          title: '健康宣教',
          detail: '根据客户已有或者潜在的问题进行相关健康宣教'
        }
      ]
    },
  ];

  gerServiceById(id) {
    let findService = this.serviceList.filter((service) => id == service.id);
    return findService.length > 0 ? findService[0] : this.serviceList[0];
  }
}
